Repository: masih999/WordPressEnhancer
Catalog: languages/energy-analytics-*.po
Languages: fa_ir

source: Energy Analytics requires PHP 7.4 or higher. Please upgrade your PHP version.
fa_ir: برای استفاده از پلاگین «تحلیل انرژی» نیاز به PHP 7.4 یا بالاتر است. لطفاً نسخه PHP خود را ارتقا دهید.

source: Plugin Activation Error
fa_ir: خطای فعال‌سازی پلاگین

source: Energy Manager
fa_ir: مدیر انرژی

source: Energy Analytics requires Composer dependencies to be installed. Please run "composer install" in the plugin directory.
fa_ir: پلاگین «تحلیل انرژی» نیاز به نصب وابستگی‌های Composer دارد. لطفاً دستور "composer install" را در دایرکتوری پلاگین اجرا کنید.

source: Energy Scripts
fa_ir: اسکریپت‌های انرژی

source: Energy Script
fa_ir: اسکریپت انرژی

source: Add New
fa_ir: افزودن جدید

source: Add New Script
fa_ir: افزودن اسکریپت جدید

source: Edit
fa_ir: ویرایش

source: Edit Script
fa_ir: ویرایش اسکریپت

source: New Script
fa_ir: اسکریپت جدید

source: View Script
fa_ir: مشاهده اسکریپت

source: Search Scripts
fa_ir: جستجوی اسکریپت‌ها

source: No scripts found
fa_ir: اسکریپتی پیدا نشد

source: No scripts found in trash
fa_ir: اسکریپتی در سطل زباله پیدا نشد

source: Energy Analytics
fa_ir: تحلیل انرژی

source: Energy Reports
fa_ir: گزارش‌های انرژی

source: Analytics Dashboard
fa_ir: داشبورد تحلیلی

source: Custom Scripts
fa_ir: اسکریپت‌های سفارشی

source: Settings
fa_ir: تنظیمات

source: You do not have sufficient permissions to access this page.
fa_ir: شما مجوز کافی برای دسترسی به این صفحه را ندارید.

source: Sync ACF Fields
fa_ir: همگام‌سازی فیلدهای ACF

source: Export to PDF
fa_ir: خروجی PDF

source: An error occurred during the export process
fa_ir: خطایی در فرآیند خروجی رخ داد

source: Energy Analytics Dashboard
fa_ir: داشبورد تحلیل انرژی

source: Export Dashboard to PDF
fa_ir: خروجی داشبورد به PDF

source: Energy Usage Over Time
fa_ir: مصرف انرژی در طول زمان

source: Energy Distribution
fa_ir: توزیع انرژی

source: Consumption by Source
fa_ir: مصرف بر اساس منبع

source: Efficiency Metrics
fa_ir: معیارهای کارایی

source: Energy Analytics Settings
fa_ir: تنظیمات تحلیل انرژی

source: Appearance Settings
fa_ir: تنظیمات ظاهری

source: Performance Settings
fa_ir: تنظیمات عملکرد

source: ACF Settings
fa_ir: تنظیمات ACF

source: Primary Chart Color
fa_ir: رنگ اصلی نمودار

source: Secondary Chart Color
fa_ir: رنگ ثانویه نمودار

source: Tertiary Chart Color
fa_ir: رنگ سوم نمودار

source: Quaternary Chart Color
fa_ir: رنگ چهارم نمودار

source: PDF Logo URL
fa_ir: آدرس لوگو PDF

source: Cache Lifetime (seconds)
fa_ir: طول عمر کش (ثانیه)

source: ACF JSON Path
fa_ir: مسیر فایل JSON مربوط به ACF

source: Customize the appearance of charts and PDF exports.
fa_ir: ظاهر نمودارها و خروجی‌های PDF را سفارشی کنید.

source: Configure caching and performance settings.
fa_ir: تنظیمات کش و عملکرد را پیکربندی کنید.

source: Configure Advanced Custom Fields integration.
fa_ir: یکپارچه‌سازی با فیلدهای سفارشی پیشرفته (ACF) را پیکربندی کنید.

source: URL to the logo image to use in PDF exports.
fa_ir: آدرس تصویر لوگو برای استفاده در خروجی‌های PDF.

source: The time in seconds that API responses should be cached. Set to 0 to disable caching.
fa_ir: زمان به ثانیه که پاسخ‌های API باید در کش ذخیره شوند. برای غیرفعال کردن کش، مقدار را 0 قرار دهید.

source: Path to ACF JSON file
fa_ir: مسیر فایل JSON مربوط به ACF

source: Enter the path to your ACF JSON file, or upload a new file below.
fa_ir: مسیر فایل JSON مربوط به ACF را وارد کنید، یا فایل جدیدی را در زیر آپلود نمایید.

source: Upload ACF JSON File:
fa_ir: آپلود فایل JSON مربوط به ACF:

source: Upload and Save
fa_ir: آپلود و ذخیره

source: Script Information
fa_ir: اطلاعات اسکریپت

source: Test Script
fa_ir: آزمایش اسکریپت

source: Utility Functions
fa_ir: توابع کمکی

source: Energy Calculations
fa_ir: محاسبات انرژی

source: Unit Conversion
fa_ir: تبدیل واحد

source: Reporting
fa_ir: گزارش‌دهی

source: Other
fa_ir: سایر

source: Version:
fa_ir: نسخه:

source: Author:
fa_ir: نویسنده:

source: Category:
fa_ir: دسته‌بندی:

source: Here you can test your script by providing sample input data and checking the results.
fa_ir: اینجا می‌توانید اسکریپت خود را با ارائه داده‌های نمونه ورودی آزمایش کرده و نتایج را بررسی کنید.

source: Test Input (JSON):
fa_ir: داده ورودی آزمایشی (JSON):

source: Run Script
fa_ir: اجرای اسکریپت

source: Clear Output
fa_ir: پاک کردن خروجی

source: Output:
fa_ir: خروجی:

source: Console:
fa_ir: کنسول:
